//즉시 실행 함수 작성법
//즉시 실행 함수를 사용하는 이유는
//한 번 실행시키고 사용하지 않을 것 같은 변수나 코드를 즉시 실행 함수로 만들고 호출하는 방식
//변수나 함수명이 겹치지 않고 충돌하지 않도록 사용이 가능하다.

//즉시 실행 함수 작성
/* 즉시 실행 함수 구조
    익명함수랑 비슷하게 생겼지만 전역에 선언한다는 점과 ()안에 작성한다는 차이점이 있다.
(function("매개변수로 사용 할 이름"){

}("전달 할 매개변수"));
*/

//실행식 괄호에 매개변수를 전달하면 된다.
(function(){
    console.log("즉시 실행 함수");
    let a = 5;
}());
//  console.log(a);  //결과: error!     함수 안에서만 사용하는 변수이기 때문이다.

function temp(b){
    (function(c){
        console.log("즉시 실행 함수");
        let a = 5;
        console.log(c);
    }(b));
}

temp("안녕 매개변수");